src/InformationRegisters/ТехнологическийЖурнал/ТехнологическийЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТехнологическийЖурнал</name>
  <resources>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Контекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КонтекстХэш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИсключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстИсключения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстИсключенияХэш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДробныеСекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлиентскоеПриложение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформационнаяБазаВСтроку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторTCPСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусHTTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаголовкиHTTP</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификаторСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дубликат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяЗапись</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидБлокировки</name>
    <type>
      <types>EnumRef.ВидыБлокировок</types>
    </type>
  </resources>
  <resources>
    <name>Интерфейс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Метод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВСтроку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследняяСтрокаТекстаИсключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследняяСтрокаКонтекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсключительнаяСитуация</name>
    <type>
      <types>CatalogRef.ИсключительныеСитуации</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.СобытияТЖ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФайлЖурнала</name>
    <type>
      <types>CatalogRef.ФайлыЖурнала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТехнологическийЖурнал/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура СвязанныеЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Строка = СвязанныеЗаписи.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("Дата", Строка.Дата);
	ЗначениеКлюча.Вставить("Тип", Строка.Тип);
	ЗначениеКлюча.Вставить("Кластер", Строка.Кластер);
	ЗначениеКлюча.Вставить("РабочийСервер", Строка.РабочийСервер);
	ЗначениеКлюча.Вставить("ИнформационнаяБаза", Строка.ИнформационнаяБаза);
	ЗначениеКлюча.Вставить("ФайлЖурнала", Строка.ФайлЖурнала);
	ЗначениеКлюча.Вставить("УникальныйИдентификатор", Строка.УникальныйИдентификатор);
	ЗначениеКлюча.Вставить("КонтрольнаяПроцедура", Строка.КонтрольнаяПроцедура);
	Аргументы = Новый Массив;
	Аргументы.Добавить(ЗначениеКлюча);
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ТехнологическийЖурнал", Аргументы); 
	ОткрытьФорму("РегистрСведений.ТехнологическийЖурнал.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДубликатОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Аргументы = Новый Массив;
	Аргументы.Добавить(Новый Структура("УникальныйИдентификатор, ФайлЖурнала", Запись.Дубликат, ФайлДубликата));
	Ключ = Новый ("РегистрСведенийКлючЗаписи.ТехнологическийЖурнал", Аргументы); 
	ОткрытьФорму("РегистрСведений.ТехнологическийЖурнал.ФормаЗаписи", Новый Структура("Ключ", Ключ),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДубликат();
	ЗаполнитьСвязанныеЗаписи();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязанныеЗаписи()
	
	Если ЗначениеЗаполнено(Запись.ГоловнаяЗапись) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТехнологическийЖурнал.Контекст,
			|	ТехнологическийЖурнал.ТекстИсключения,
			|	ТехнологическийЖурнал.Тип,
			|	ТехнологическийЖурнал.УникальныйИдентификатор,
			|	ТехнологическийЖурнал.ФайлЖурнала,
			|	ТехнологическийЖурнал.Дата КАК Дата,
			|	ТехнологическийЖурнал.ДробныеСекунды КАК ДробныеСекунды,
			|	ТехнологическийЖурнал.Продолжительность,
			|	ТехнологическийЖурнал.Дата КАК Дата1,
			|	ТехнологическийЖурнал.Кластер,
			|	ТехнологическийЖурнал.РабочийСервер,
			|	ТехнологическийЖурнал.ИнформационнаяБаза,
			|	ТехнологическийЖурнал.КонтрольнаяПроцедура
			|ИЗ
			|	РегистрСведений.ТехнологическийЖурнал КАК ТехнологическийЖурнал
			|ГДЕ
			|	(ТехнологическийЖурнал.ГоловнаяЗапись = &ГоловнаяЗапись
			|			ИЛИ ТехнологическийЖурнал.УникальныйИдентификатор = &ГоловнаяЗапись)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата,
			|	ДробныеСекунды";
		Запрос.УстановитьПараметр("ГоловнаяЗапись", Запись.ГоловнаяЗапись);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Выгрузка.Колонки.Добавить("ДробнаяДата");
		Для Каждого Строка Из Выгрузка Цикл
			
			Строка.ДробнаяДата = Формат(Строка.Дата, "ДФ='yyyy-MM-dd HH:mm:ss'") + "." + Формат(Строка.ДробныеСекунды, "ЧЦ=4; ЧВН=; ЧГ=0");
			
		КонецЦикла;
		СвязанныеЗаписи.Загрузить(Выгрузка);
		
	Иначе
		Элементы.СтраницаСвязанныеЗаписи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДубликат()
	
	Если ЗначениеЗаполнено(Запись.Дубликат) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТехнологическийЖурнал.ФайлЖурнала КАК ФайлЖурнала
			|ИЗ
			|	РегистрСведений.ТехнологическийЖурнал КАК ТехнологическийЖурнал
			|ГДЕ
			|	ТехнологическийЖурнал.УникальныйИдентификатор = &УникальныйИдентификатор";
		Запрос.УстановитьПараметр("УникальныйИдентификатор", Запись.Дубликат);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ФайлДубликата = Выборка.ФайлЖурнала;
		Иначе
			Элементы.Дубликат.КнопкаОткрытия = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Дубликат.КнопкаОткрытия = Ложь;
	КонецЕсли;
	
КонецПроцедуры
